Revit 2027 API
UIMacroManager.MacroManager Property
 The DB macro manager.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroManager MacroManager { get; }
Public ReadOnly Property MacroManager As MacroManager
	Get
public:
property MacroManager^ MacroManager {
	MacroManager^ get ();
}
member MacroManager : MacroManager with get
Property Value
MacroManager
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace